<a href="https://colab.research.google.com/github/alexsander020/Exercicios-de-IA/blob/main/Pre_processamento_de_dados01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
dic = {"Nome" : ["Isa", "Peter", "Antonio"],
       "Idade" : ["19", "28", "35"],
       "Salario" : ["19000", "5000", "19000"],
       "Gênero" : [" F ", " M ", " M "],
       "Cargo" : ["Gerente", " Supervisor ", " Programador "]
    
}

In [3]:
df = pd.DataFrame(dic)
df

      Nome Idade Salario Gênero          Cargo
0      Isa    19   19000     F         Gerente
1    Peter    28    5000     M     Supervisor
2  Antonio    35   19000     M    Programador

In [4]:
print(df)

      Nome Idade Salario Gênero          Cargo
0      Isa    19   19000     F         Gerente
1    Peter    28    5000     M     Supervisor
2  Antonio    35   19000     M    Programador

In [5]:
df.info

<bound method DataFrame.info of       Nome Idade Salario Gênero          Cargo
0      Isa    19   19000     F         Gerente
1    Peter    28    5000     M     Supervisor
2  Antonio    35   19000     M    Programador >

In [7]:
df = pd.get_dummies(df, columns=["Gênero"])

In [8]:
df

      Nome Idade Salario          Cargo  Gênero_ F   Gênero_ M
0      Isa    19   19000        Gerente           1           0
1    Peter    28    5000    Supervisor            0           1
2  Antonio    35   19000   Programador            0           1

In [10]:
df = df.drop( columns = ["Cargo"])
df

      Nome Idade Salario  Gênero_ F   Gênero_ M
0      Isa    19   19000           1           0
1    Peter    28    5000           0           1
2  Antonio    35   19000           0           1